import { Keyboard, TouchableWithoutFeedback } from "react-native";
import { Alert } from "react-native";
import * as SecureStore from "expo-secure-store";

export const HideKeyboard = ({ children }) => (
  <TouchableWithoutFeedback onPress={() => Keyboard.dismiss()}>
    {children}
  </TouchableWithoutFeedback>
);

export function showAlert(title, message) {
  Alert.alert(title, message, [
    {
      text: "Okay",
      onPress: () => console.log("Cancel Pressed"),
      style: "cancel",
    },
  ]);
}

export const setToken = (token) => {
  return SecureStore.setItemAsync("secure_token", token);
};

export const getToken = () => {
  return SecureStore.getItemAsync("secure_token");
};
export const removeToken = () => {
  return SecureStore.deleteItemAsync("secure_token");
};

// setToken('#your_secret_token');
// getToken().then(token => console.log(token));
export const niyam = [
  "श्री ऋषभदेव जी - राजमां, रसमलाई, रसभरी, रस लेकर नहीं खाना, चीनी या नमक कम ज्यादा तो शिकायत न करें।",
  "श्री ऋषभदेव जी - राजमां, रसमलाई, रसभरी, रस लेकर नहीं खाना, चीनी या नमक कम ज्यादा तो शिकायत न करें।",
  "श्री अजितनाथ जी - अंगूर, अंगूरीपेठा, अरबी, अपमान न करें। अपनी निंदा करें, अनर्थ दण्ड न।",
  "श्री संभवनाथ जी - सेम, सेब, समोसा, सफेद रसगल्ला, स्पाइड, बड़ों पर क्रोध न, दण्ड -1 सामायिक।",
  "श्री अभिनन्दन जी - अमरूद, अरहर दाल, अखरोट, अपशब्द न बोलों, छोटों पर क्रोध न, दण्ड - 50 रू।",
  "श्री सुमतिनाथ जी - संतरा, शिमला मिर्च, शक्करपारे, सिंगर, शर्बत, शकरकंदी, स्पंज रसगुल्ला, बराबर वालो पर क्रोध न, दण्ड 1 नवकार माला। ",
  "श्री पदमप्रभ जी - पेड़ा, पपीता, पत्तागोभी, पकौड़े, परांठा, पौहा, परमल, पिश्ताबर्फी, स्नान में साबुन इस्तेमाल नहीं करना।",
  "श्री सुपार्श्वनाथ जी - सीताफल, सरदा, सैंडविच, सोस, सिंघाड़ा, शहतूत, स्ट्राबेरी, सूप, साबुन फिसल तो उठानी नहीं।",
  "श्री चन्द्रप्रभ जी - चीकू, चमचम, चाकलेट, चूरमा चाय, चूर्ण, चेरी, चनादाल, चुलाई का लड्डू, चिंता न करनी, न देनी।",
  "श्री सुविधि नाथ जी- शाही पनीर, सेमियां, सोहन हलवा, सूप, सोया कटोरी, सोन पपड़ी, बाजार में खड़े होकर कुछ खाना नहीं।",
  "श्री शीतल नाथ जी - पतीशा, पिश्ता, पाश्ता, पनीर, पालक, पन्ना, पुलाव, पान, पेस्ट्री पिटाई नहीं करनी।",
  "श्री श्रेयांस नाथ जी - लोबिया, लीची, लस्सी, लिम्का, लड्डू, लौकी, लाल मिर्च, रात्रि भोजन नहीं करना, लड़ाई नहीं करनी।",
  "श्री वासुपूज्य जी - बालुस्याही, भिंडी, ब्रैड, भुजिया, बर्गर, भटूरे, बूंदी, भेलपूरी, बेलगिरी, बथुआ, ब्रह्मचर्य पालन, नवकारसी। ",
  "श्री विमलनाथ जी - बर्फी, बंदगोभी, भल्ले, बिस्कुट, बादाम, बाजारा-रोटी, बादाम बर्फी, बड़ो पास 1 घंटा बैठना- सेवा करना।",
  "श्री अनन्तनाथ जी - आलू, आलुबुखारा, आम, आइसक्रीम, आटे का लड्डू, आज्ञापालन, अंह-भाषा न, आदर्श= शीशा न देखें।",
  "श्री धर्मनाथ जी - दूध, दही, दलिया, दालबाटी, दालमखनी, दाख, दही भल्ले, दया दान करना, दो टूक जवाब न दें।",
  "श्री शान्तिनाथ जी - तोरी, तारी, तरबूज, तिलपपड़ी, तिलगोजा, तंदूरी रोटी, तिल का लड्डू, तू से न बोलें।",
  "श्री कुंथुनाथ जी - केला, करेला, कढ़ी, कुल्फी, कलाकंद, कोप्ता, कमी न निकालें, कुल्फी, कुरकुरे, क्रोध न करें।",
  "श्री अरनाथ जी - आडू, अचार, अदरक, आवंला, अप्पे, अनानास, आमपापड़ा, दिन में टी.वी. न देखें।",
  "श्री मल्लिनाथ जी - मक्खन, मक्खनबड़ा, मक्खनीदाल, मुंगफली, मक्खनबाजी, मैग्गी, मैदे की चीजें न खाएं, मुरमरे, मखाने, एक समय 6 से ज्यादा द्रव्य नहीं लगाने।",
  "श्री मुनिसुव्रत जी - मटर, मौसमी, मलाई, मुरब्बा, मेथी, मुनक्का, मसूरदाल, मोबाईल प्रात:10:00 बजे तक न।",
  "श्री नमिनाथ जी - नाशपाती, नानखटाई, नूडल्स, नमकीन चावल, नारियलपानी, निंबूपानी, नारीयल बर्फी, नारियल क. का जूस।",
  "श्री अरिष्टनेमी जी - इडली, इमली, इमरती, इलायची, इक्षुरस, इडली-सांभर, इधर-उधर की व्यर्थ चर्चा न, ईर्ष्या न करें।",
  "श्री पार्श्वनाथ जी - पेठा, पेठे की मिठाई, पूरी, पाव भाज्जी, पिज्जा, प्याज, प्रथम व अन्तिम रोटी अनचुपड़ी, पर-निन्दा मे रस न लें।",
  "श्री महावीर स्वामी जी - मंगोड़ी, मूली, मूंग की दाल का हलवा व लड्डू, मालपूड़ा, मावा, मौन पूर्वक भोजन करें।",
  "श्री सुदर्शन गुरवे नमः - ककडी, काले चने, काजू, किशमिश, काजू की बर्फी, कोल्डड्रिंक प्रिय वस्तु का त्याग, कमखाएं।",
  "श्री गौतमस्वामिने नमः - कद्दू, कलाकंद, कचोरी, केक, कोफी, कचालू, रात्रि 9 बजे के बाद कुछ खाना-पीना नहीं।",
  "श्री सुधर्मा स्वाममिने नमः - गुलाब जामुन, गोलगप्पे, गोभी, गूद, गूंद कतीरा, गाली नहीं देनी दंड-वस्त्र दान।",
  "श्री जम्बू स्वामिने नमः - खीरा, खीर, खोए की बर्फी, खजूर, खांडवी, खरबूजा, संघट्टा टालें। ",
  "श्री चन्दन बालायै नमः - घीया, घेवर, घी, गट्टे, घीया-रायता, गुंजिया, घास पर पैर न, घृणा न, घर समय पर आना",
  "श्री मयाराम गुरवे नमः - जलेबी, जामुन, जलजीरा, झूठ न, झूठा न, जी से बोलें। ",
  "श्री मदनलाल गुरवे नमः - टिंडा, टमाटर, टिक्की. टोफी, टोस्ट. ठंडाई, ढोकला, टैंशन न लें न दें।",
];
